package com.mohammad.mojapplication.RegistrationFragments;

import android.os.Bundle;
import android.support.annotation.Nullable;
import android.support.v4.app.Fragment;
import android.view.KeyEvent;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;
import android.widget.TextView;

import com.mohammad.mojapplication.Communicator;
import com.mohammad.mojapplication.MOJManager;
import com.mohammad.mojapplication.Objects.NotaryTemlpate;
import com.mohammad.mojapplication.R;

/**
 * Created by user on 11/5/2015.
 */
public class Welcome extends Fragment
{
    private TextView tvSkipToMain;
    private Button btnReg;
    private Button btnLog;
    Communicator comm;
    MOJManager mojManager;

    @Nullable
    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container, Bundle savedInstanceState)
    {
        View v = inflater.inflate(R.layout.fragment_welcome, container, false);
        mojManager = MOJManager.getMOJManager(getActivity());

        NotaryTemlpate notaryTemlpate = new NotaryTemlpate(" بأن يقوم مقامي وينوب عني بالاشراف والادراة وفي قيادة السيارة المذكورة اوصافها داخل الامارات العربية المتحدة وخارجها ، وتوليه الصيانة وتأمينها وانهاء اجراءاتها الجمركية وسداد الرسوم والغرامات وله في سبيل ذلك ان يمثلني امام جميع الجهات والدوائر الرسمية وشبه الرسمية والمحلية بدولة الامارات العربية المتحدة او خارجها بما في ذلك ادارة المرور ونقاط التفتيش والتوقيع نيابة عني على اية اوراق او مستندات متعلقة بالعمل الموكل به امام المراجع المختصة كما حق الخصومة مع الغير واقامة الدعاوي بجميع انواعها لدى كافة المحاكم بانواعها ودرجاتها المتمثلة فيما بتعلق بموضوع الوكالة وكالة خاصة لقوله وفعله ورأيه وله حرية التصرف في المركبة المذكورة اعلاه كيفما يشاء وله في ذلك حق البيع والتنازل عنها لمن يشاء او لنفسه بالشروط التي يراها مناسبة والتوقيع وقبض الثمن ودفع المخالفات واستخراج شهادات براءة الذمة والتعاقد مع شركات التأمين وله حق توكيل الغير  فيما وكل به او جزء منه واطلب من السيد الكاتب العدل التصديق عليها .  \n" +
                "اوصاف المركبة :\n" +
                "النوع   :                                                        اللون   :\n" +
                "سنة الصنع  :                                             بلد الصنع  :\n" +
                "رقم المحرك  :                                          رقم القاعدة  :\n" +
                "رقم اللوحة   :                                          جهة الإصدار:\n" +
                "\n" +
                "الموكل","Limited Power of Attorney to Act and Manage a Vehicle \n");
        mojManager.addNotaryTemp(notaryTemlpate);


        NotaryTemlpate notaryTemlpate2 = new NotaryTemlpate("وكيلا ً ينوب عني بصفتي المذكورة وافوضه الصلاحيات التالية :\n" +
                "1- تولي الممتلكات والاموال المنقولة  وغير المنقولة  والعقارية بالتخصيص والاسهم والسندات بالتداول والاستثمار والاعمار والبناء والهدم والتنمية والتطوير والصيانة والترميم والتجديد والتأمين والتأجير والتمويل والاخلاء والبيع والشراء والرهن الحيازي والتأميني وفك الرهن والهبة والوقف وقبولها وشراء العقارات وتسجيلها باسمه ومدها بكافة الخدمات من ماء وكهرباء واتصالات وتأسيس وانشاء المحال والمؤسسات والشركات التجارية بأنواعها المدنية والصناعية والدخول فيها بشراكة الاخرين وشراء الحصص النقدية والعينية وبيعها والتنازل عنها لنفسه او لغيره وفسخ الشراكة وتعيين المصفي القانوني واستقدام واستخدام الموظفين والعمال والخدم واستخراج الاقامات وبطاقات العمل والغائها وتجديدها وانهاء كافة الاجراءات وصرفهم من الخدمة .\n" +
                "2- القيام باجراءات المعينة والكشف والمسح والمراجعة والتدقيق واستخراج الرخص والاجازات والخرائط وسندات ووثائق الملكية وشهادات العضوية وكذلك اجراءات القيد والتسجيل والتصحيح والمحو والشطب والالغاء .\n" +
                "3- التصرف في جميع الرخص المملوكة لي التجارية منها او المهنية او الصناعية او السياحية او غيرها بالبيع والتنازل او الرهن او فك الرهن سواء لنفسه او للغير بالشروط التي يراها ويقرها ويقبل بها وقبض قيمة البيع نقدا ً او شيكات وصرفها من البنوك .\n" +
                "4- قبض الحقوق والاستحقاقات المالية والعينية والاثمان والايجارات والتأمينات والتعويضات والاموال الموروثة والمعاشات والرواتب التقاعدية والديون رضاء او قضاء والوفاء بالمقابل بالثمن وحقوق الغير والايجارات والاجور والمرتبات والرسوم والضرائب والتأمينات والتعويضات والبدلات والغرامات .\n" +
                "5- تمثيلي والتوقيع عني لدى عموم الاشخاص الطبيعيين والاعتباريين والوزارات والهيئات واللجان والمجالس والمراجع والدوائر الحكومية والمدنية بما فيها دوائر واقسام الاراضي والاملاك والتسجيل العقاري والمحاكم والكاتب العدل وشركات التأمين والتمويل والبنوك والنيابات العامة وقيادات الشرطة ومراكزها ووزارة العمل والعمال والجنسية والاقامة والدوائر الاقتصادية وغرفة التجارة والصناعة والبلديات وفتح البلاغات و التنازل عنها وفي تقديم العرائض والطلبات وتوكيل المحامين لاقامة الدعاوى ومتابعة اجراءات التقاضي امام جميع المحاكم بمختلف درجاتها ابتدائية واستئناف ونقض ( او تمييز ) وبكافة الامور الواردة بالمادة ( 58) من قانون الاجراءات المدنية .\n" +
                "6- تحرير وتوقيع العقود والاتفاقيات والتوكيلات على اختلاف مواضيعها ومضامينها بالشروط التي يراها ويقرها ويقبل بها وذلك تحرير وتوقيع الملاحق واجراءات التعديل والفسخ والتخرج والطلبات والمحررات والمراسلات والايصالات والمخالصات وسندات الصرف والقبض والنماذج الرسمية والاقرارات والاشكالات والاخطارات والانذارات العدلية وتلقيها والرد عليها .\n" +
                "7- اجراءات المحاسبة والبدل والمقايضة والتسوية والتسليم والاستلام والصلح والاداء والاسقاط والتنازل بعوض او بغير عوض وبيع حصصي في الشركات لنفسه او للغير .\n" +
                "8- فتح الحسابات على النواعها لدى المصارف بإسمي الشخصي او بأسماء المحال والمؤسسات والشركات التجارية والمدنية والصناعية وادارة هذه الحسابات باليداع والسحب النقدي من الحسابات الشخصية او حسابات المنشأة او بموجب الشيكات والحوالات والحصول على الائتمان من خلالها على هيئة تسهيلات وقروض وضمانات وكفالات وذلك في الاعتمادات وربط الودائع وتسييلها وفي استلام وقبض الشيكات والحوالات وتظهيرها وصرفها وفي شتى وسائر المعاملات المصرفية بما في ذلك استئجار الخزائن الحديدة واستثمارها والغاء الاستثمار وغلق الحسابات واقفالها .\n" +
                "9- وله الحق في قبض واستلام ارباحي من الاسهم والسندات والودائع في كفالة الشركات والبنوك داخل الدولة وخارجها وله حق التداول والتصرف في جميع ذلك شراء وبيع من الشركات التي تطرح اسمها للإكتتاب في دولة الامارات العربية المتحدة واستلام شهادات التخصيص واستخراج بطاقة المستثمر واجراء التعديلات عليها والتوقيع بالإستلام و التصرف بالبيع والرهن والتنازل والتداول بأية اسهم مملوكة لي او التي قام بشرائها باسمس ونقل ملكيتها سواء بإسمه او بإسم الغير وله حق تحويل الاسهم من والى المقاصة والى الوسطاء دون الرجوع الي واستلام ثمن الاسهم المباعة واستلام ارباحها السنوية ، وله حق التفاوض وتعيين الوسطاء وفتح الحسابات المصرفية لديهم  واقفالها ودفع العمولات لهم واستلام الشيكات وصرفها من البنك السحوبة عليه ةحضور اجتماعات الجمعيات العمومية والتصويت على قراراتها وادارة الحسابات في الاسواق المالية بالدولة وخارجها بما فيها سوق ابوظبي للأوراق المالية وسوق دبي المالي .\n" +
                "10- وله حق بيع وشراء السيارات بإسمي والتصرف باية سيارة مملوكة لي بكافة اوجه التصرف بالبيع  وحق الاتفاق على الثمن وقبضه وتجديد ونقل الملكية لإسمه او لإسم الغير وقيادتها داخل وخارج الدولة وتوليها بالصيانة وتأمينها وانهاء اجراءاتها الجمركية وسداد الرسوم والغرامات وتسفيرها وتوكيل الغير للشحن والقيادة .\n" +
                "11- توكيل الغير بالصلاحيات اعلاه او بجزء منها وتوكيل وعزل المحامين والوكلاء مرة تلو المرة .\n" +
                "12- هذا التوكيل مفوض لراي الوكيل وقوله وفعله وله حق التعاقد مع النفس او الغير.\n" +
                "13- يسري العمل بهذا التوكيل داخل وخارج دولة الامارات العربية المتحدة وعليه اوقع واطلب من الكاتب العدل التصديق على هذا التوكيل واعتماده حسب الاول .\n" +
                " \n" +
                "\n" +
                "الموكل" , "General Power of Attorney to Act and Manage \n");
        mojManager.addNotaryTemp(notaryTemlpate2);

        tvSkipToMain = (TextView) v.findViewById(R.id.tvSkipToMain);
        tvSkipToMain.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {

                comm.sendUsertoMainActivity(null);
            }
        });

        comm = (Communicator) getActivity();
        btnReg = (Button) v.findViewById(R.id.btnReg);

        btnReg.setOnClickListener(new View.OnClickListener()
        {
            @Override
            public void onClick(View v)
            {

                comm.startStepOne();
                comm.stopWelcomeFragment();


            }
        });

        btnLog = (Button) v.findViewById(R.id.btnLogin);

        btnLog.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {


                comm.startLogin();
                comm.stopWelcomeFragment();


            }
        });

        return v;
    }





}
